public/man/man1/dconf.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - dconf.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - dconf.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>dconf - Simple tool for manipulating a dconf database</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>dconf</strong> read [-d] <em>KEY</em></p>
<p>
<strong>dconf</strong> list <em>DIR</em></p>
<p>
<strong>dconf</strong> write <em>KEY</em> <em>VALUE</em></p>
<p>
<strong>dconf</strong> reset [-f] <em>PATH</em></p>
<p>
<strong>dconf</strong> compile <em>OUTPUT</em> <em>KEYFILEDIR</em></p>
<p>
<strong>dconf</strong> update [/DBDIR/]</p>
<p>
<strong>dconf</strong> watch <em>PATH</em></p>
<p>
<strong>dconf</strong> dump <em>DIR</em></p>
<p>
<strong>dconf</strong> load [-f] <em>DIR</em></p>
<p>
<strong>dconf</strong> help [/COMMAND/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>dconf</strong> program can perform various operations on a dconf database,
such as reading or writing individual values or entire directories. This
tool operates on dconf directly, without using gsettings schema
information. Therefore, it cannot perform type and consistency checks on
values. The *gsettings*(1) utility is an alternative if such checks are
needed.</p>
<p>
The <em>DIR</em> arguments must be directory paths (starting and ending with
<em>), the /KEY</em> arguments must be key paths (starting, but not ending with
<em>) and the /PATH</em> arguments can be either directory or key paths.</p>
<p>
The <em>OUTPUT</em> argument must the location to write a (binary) dconf
database to and the <em>KEYFILEDIR</em> argument must be a .d directory
containing keyfiles.</p>
<p>
<em>VALUE</em> arguments must be in GVariant format, so e.g. a string must
include explicit quotes: &#34;foo&#34;. This format is also used when printing
out values.</p>
<p>
Note that dconf needs a D-Bus session bus connection to write changes to
the dconf database.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
COMMANDS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>read</strong></p>
<blockquote>
<p>Read the value of a key.</p>
</blockquote>
<p>
<strong>list</strong></p>
<blockquote>
<p>List the sub-keys and sub-directories of a directory.</p>
</blockquote>
<p>
<strong>write</strong></p>
<blockquote>
<p>Write a new value to a key.</p>
</blockquote>
<p>
<strong>reset</strong></p>
<blockquote>
<p>Reset a key or an entire directory. For directories, <strong>-f</strong> must be
specified.</p>
</blockquote>
<p>
<strong>compile</strong></p>
<blockquote>
<p>Compile a binary database from keyfiles.</p>
<p>
The result is always in little-endian byte order, so it can be safely
installed in share. If it is used on a big endian machine, dconf will
automatically byteswap the contents on read.</p>
</blockquote>
<p>
<strong>update</strong></p>
<blockquote>
<p>Update the system dconf databases.</p>
</blockquote>
<p>
<strong>watch</strong></p>
<blockquote>
<p>Watch a key or directory for changes.</p>
</blockquote>
<p>
<strong>dump</strong></p>
<blockquote>
<p>Dump an entire subpath to stdout. The output is in a keyfile-like
format, with values in GVariant syntax.</p>
</blockquote>
<p>
<strong>load</strong></p>
<blockquote>
<p>Populate a subpath from stdin. The expected format is the same as
produced by <strong>dump</strong>. Attempting to change non-writable keys cancels the
load command. To ignore changes to non-writable keys instead, use <strong>-f</strong>.</p>
</blockquote>
<p>
<strong>help</strong></p>
<blockquote>
<p>Display help and exit. If <em>COMMAND</em> is given, display help for this
command.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
ENVIRONMENT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>DCONF_PROFILE</strong></p>
<blockquote>
<p>This environment variable determines which dconf profile to use. See
*dconf*(7).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*dconf*(7), *gsettings*(1), *dconf-editor*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
